export const alphaQuotes = {
  unlock: {
    id: 0,
    lines: [
      "我感觉到...",
      "有人来了...",
      "你好？",
      "等一下，",
      "你是个凡人？",
      "...",
      "你这样的凡人，怎么可能活着爬到我这里，",
      "面对真正的天神之力？",
      "你得到了帮助，对吗？",
      "是那些低阶的天神，对吧？",
      "和————佩勒？",
      "你得知道，",
      "自从我派佩勒出去寻找其他天神后，祂就再也没听过我的命令。",
      "祂现在觉得祂是老大了。",
      "我很快就会制裁祂的。",
      "但暂时，我得先对付你。",
      "前进吧，进入我的领域。",
      "但是你要知道，",
      "前方没有退路。",
      "因为我是阿尔法，黑暗之神。",
      "而你————永远别想重见天日了。"
    ]
  },
  enter: {
    id: 1,
    lines: [
      "欢迎来到我的现实，",
      "我的最强领域。",
      "此处唯有黑暗永驻。",
      "踏入者有去无回。",
      "前进吧,",
      "但且多看看现在尚存的光明，",
      "这是光明最后一次临照于你。"
    ]
  },
  fourthDB: {
    id: 2,
    lines: [
      "所以，",
      "八个维度重新恢复了。",
      "但这只是开始。",
      "你不会获胜的。",
      "黑暗将把你缚得更紧。"
    ]
  },
  fifthDB: {
    id: 3,
    lines: [
      "献祭？",
      "*(嗤笑)*",
      "献祭有什么用？",
      "毕竟在开始面对我时，你已经没有什么可以失去的了。"
    ]
  },
  galaxy: {
    id: 4,
    lines: [
      "...",
      "所以这就是那种力量...",
      "这就是毁灭了佩勒和其他天神的力量，对吧？",
      "星系，你独特的力量来源。",
      "不幸的是，现在此地是我的主场。",
      "你的星系最终会毁灭你...",
      "即使它们的效力将变得无比微弱..."
    ]
  },
  infinity: {
    id: 5,
    lines: [
      "你的反物质达到了上限。",
      "但到此为止了。",
      "现在每次重置只让你的速度快了微不足道的一点...",
      "挣扎也是徒劳，你的末日即将到来。",
      "承认失败吧，",
      "我可能会让你活下去，但谁知道呢？"
    ]
  },
  autoCrunch: {
    id: 6,
    lines: [
      "你以为我的现实和先前的一样寻常？",
      "你觉得你能打破无限并获胜？",
      "抱歉，",
      "今天不行。",
      "吾之强大，你连仰望的资格都没有。",
      "吾之时间墙，会让你生不如死。"
    ]
  },
  breakInfinity: {
    id: 7,
    lines: [
      "你！你...",
      "你该不会以为，就凭那点可怜的升级，就能挡住我吧？",
      "相信我，你根本没命活到我死的时候。",
      "哦，是么。你以为自己现在能无限制造反物质了？",
      "可事情没那么简单。",
      "说到底，此地是我的主场。",
      "你不过是一枚棋子，而我才是执棋之人。",
      "在你不自量力地来送死之前，先搞清楚状况。",
      "如果你承认了，我可能会让你活下去。",
      "否则，你早已是个死人了。"
    ]
  },
  powerGalaxies: {
    id: 8,
    lines: [
      "所以，",
      "你该不会以为自己能扭转注定的终局吧？",
      "反抗也是徒劳，你到现在还没看清吗？",
      "你为何始终不明白，胜利早已注定归我？",
      "没错，佩勒这句话是从我这里学来的。",
      "不过现在，这些都无关紧要了。",
      "无论如何，你终将落败。",
      "到最后，唯有黑暗永存。"
    ]
  },
  allBreakUpgrades: {
    id: 9,
    lines: [
      "停手吧，",
      "别自讨苦吃。",
      "你已经输了，",
      "为什么你就是不明白？",
      "挣扎都是多余，",
      "一切努力都是徒劳。",
      "你的败亡将至。"
    ]
  },
  allInfinityChalls: {
    id: 10,
    lines: [
      "你真的以为这会有用吗？",
      "你觉得你有那个本事？",
      "大错特错！",
      "你的终结就在眼前。",
      "直面你的结局吧。"
    ]
  },
  replicanti: {
    id: 11,
    lines: [
      "你为什么就是不肯罢休？",
      "你何必再去挽回注定覆灭的残局？",
      "愚不可及。",
      "你早晚会认清————你根本不够格与我为敌。",
      "我会亲自让你明白。"
    ]
  },
  eighthInfinityDimension: {
    id: 12,
    lines: [
      "停下！",
      "到此为止吧！",
      "弱小的你，怎么挣扎都是白费力气。",
      "我可不同于其他天神，",
      "那帮...没用的东西。",
      "不，我远比他们强大。",
      "你赢不了我。",
      "胜局早已注定。",
      "现在，准备变得生不如死吧！"
    ]
  },
  eternity: {
    id: 13,
    lines: [
      "你以为躲到别的时间去就有用吗？",
      "你还不明白吗？",
      "其它的时间也同样被诅咒了！",
      "你永远无法超越我。"
    ]
  },
  improveEP: {
    id: 14,
    lines: [
      "现在停下！",
      "你疯了吗？",
      "靠这点可怜的升级就想对抗我？你果真是疯了！",
      "我现在展现的力量，只是皮毛而已！"
    ]
  },
  fourthTimeDimension: {
    id: 15,
    lines: [
      "你感觉到了吧？",
      "层层削弱正在把你压垮？",
      "没错，我的现实正在蚕食你的力量。",
      "是不是感觉进度越来越迟缓了？",
      "胜负很快就会见分晓了。",
      "无论如何，赢的终究是我。"
    ]
  },
  infinityChallTimeBoost: {
    id: 16,
    lines: [
      "你怎么还活着？",
      "这种力量...",
      "根本阻止不了我。",
      "我仍然会碾碎你。"
    ]
  },
  prepareEternityChalls: {
    id: 17,
    lines: [
      "够了！",
      "你为什么就不肯认输？",
      "你明知胜负已定，却仍然...",
      "仍然...",
      "*(叹气)*",
      "痛苦依旧会缠着你，孩子。",
      "记住我的话。"
    ]
  },
  firstEternityChall: {
    id: 18,
    lines: [
      "只有一个？",
      "哈哈哈！",
      "你不可能全部完成。",
      "你会葬身此处，正如之前的那些失败者。"
    ]
  },
  bulkEternityChall: {
    id: 19,
    lines: [
      "你还在挣扎？",
      "何必呢？",
      "你明知自己会输，",
      "却还在苦苦挣扎？",
      "胜负已定，孩子。",
      "用你那松饼脑袋给我记住。"
    ]
  },
  passiveIPGen: {
    id: 20,
    lines: [
      "怎么可能？",
      "你怎么可能撑到现在？",
      "在我做了这一切之后...",
      "不！",
      "必须到此为止！"
    ]
  },
  eternityChallTen: {
    id: 21,
    lines: [
      "不...",
      "你必须停下！",
      "你走不了更远了！",
      "你...",
      "你终究还是会输！"
    ]
  },
  uncapReplicanti: {
    id: 22,
    lines: [
      "别以为这就结束了！",
      "接下来还有更多的痛苦等着你！",
      "给我听好了！",
      "很快...",
      "你将尝到真正的痛苦。"
    ]
  },
  eternityChallEleven: {
    id: 23,
    lines: [
      "现在明白了吧？",
      "一切都在计划之中。",
      "这是你的死地。",
      "现在，终于...",
      "你将痛不欲生！",
      "哦对了，我早就赢了。"
    ]
  },
  completeEternityChallEleven: {
    id: 24,
    lines: [
      "...",
      "怎么会？",
      "你是怎么做到的？",
      "我明明...",
      "明明设下了重重阻碍...",
      "不！",
      "你不能继续下去了...",
      "你必须停下！"
    ]
  },
  unlockDilation: {
    id: 25,
    lines: [
      "此事已成。",
      "你已被困住。",
      "你的徒劳挣扎，到此为止了！"
    ]
  },
  dilatedEternity: {
    id: 26,
    lines: [
      "这...",
      "别白费力气了！",
      "你赢不了我！",
      "你远不是我的对手！",
      "你已经输了！"
    ]
  },
  ttGen: {
    id: 27,
    lines: [
      "不...",
      "你...",
      "你不能再继续下去了！"
    ]
  },
  eighthTimeDimension: {
    id: 28,
    lines: [
      "不！",
      "你不会赢的！",
      "我需要...一个办法...",
      "我有一计...",
      "你照样会输！"
    ]
  },
  reality: {
    id: 29,
    lines: [
      "...",
      "什么？？？",
      "怎么会...",
      "你怎么...",
      "你到底是怎么做到的？！？！",
      "我倾尽所有...",
      "明明我什么办法都尝试了...",
      "等一下...",
      "我的力量...",
      "正在...消失?",
      "不...",
      "你竟敢窃取我的力量！",
      "诅咒你！",
      "凡人渣滓！",
      "我绝不接受被你这种货色击败！",
      "我发誓...",
      "总有一天，我会卷土重来...",
      "而你...",
      "你和佩勒...",
      "你们会为背叛付出代价!",
      "我和你没完，凡人渣滓...",
      "你逃不掉你的末日的...",
      "你逃不掉...的...",
      "你们每一个...都逃不掉...",
      "..."
    ]
  }
};
