export const effarigQuotes = {
  initial: {
    id: 0,
    lines: [
      "欢迎来到我小小的居所。",
      "我是管理符文的鹿颈长。",
      "我和特蕾莎不一样，我不像你想的那样简单。",
      "我使用符文之碎片来践行我的意志。",
      "我为了丰富这个领域而收集它们。",
      "你还在等什么？开始吧。",
    ]
  },
  unlockWeights: {
    id: 1,
    lines: [
      "你喜欢我的小店吗？这里的东西不多，但这是我开的。"
    ]
  },
  unlockGlyphFilter: {
    id: 2,
    lines: [
      "此次购入定能帮到许多。"
    ]
  },
  unlockSetSaves: {
    id: 3,
    lines: [
      "这太多了吗？我觉得有点太多了。"
    ]
  },
  unlockRun: {
    id: 4,
    lines: [
      "你把我的库存买光了…行吧，起码我有钱了。",
      "我的现实的核心是受难“每一层都比上一层更加困难。",
      "我希望你永远不能完成它。",
    ]
  },
  completeInfinity: {
    id: 5,
    lines: [
      { text: "你已完成鹿颈长的无限阶段。", showCelestialName: false },
      "这只是第一层，后面会更糟糕。",
      "除了我之外，无人能在我的领域更进一步。",
    ]
  },
  completeEternity: {
    id: 6,
    lines: [
      { text: "你已完成鹿颈长的永恒阶段。", showCelestialName: false },
      "到此为止。我不想让你比这更进一步了。",
      "这是你这辈子都完成不了的。",
      "我就在这等着，直到你放弃。",
    ]
  },
  completeReality: {
    id: 7,
    lines: [
      { text: "你已完成鹿颈长的现实阶段。", showCelestialName: false },
      "所以这就是那恶魔般的力量…这肯定令祂者胆寒…",
      "你认为这值得吗？为我的所作所为而悲伤？",
      "你又是为了什么？你本来可以加入，我们本来可以合作。",
      "但，并不是。已经结束了。你走吧，留我一人独守剩下的残骸。",
    ]
  },
  expansionPacks: {
    id: 8,
    lines: [
      "噢，嗨，特蕾莎。",
      "你知道我们现在在哪吗？",
      "看来不知道。",
      "等等，这家伙就是一直拆我家的那个！",
      "佩勒叫他什么来着...",
      "毁灭之源？",
      "是你把我带到这里的吗？",
      "你为什么浑身散发出力量？",
      "等一下...",
      "无名氏们是怎么从囚禁中被释放的？"
    ]
  },
  effarigPack: {
    id: 9,
    requirement: () => ExpansionPack.effarigPack.isBought,
    lines: [
      "找到你要找的东西了吗？",
      "我本想把它们藏起来，以免那些可能的滥用者发现。",
      "鉴于你之前干过的事，我本不该对你抱太大期望...",
      "不过我想你这么做肯定是有原因的。",
      "为了省去你的麻烦，我直接把奖励给你。",
      "你现在不会再毁掉我的家了吧？",
      "抱歉刚才发火了，我早该知道你骨子里其实是个很随和的人。",
      "也许我们还能做朋友。",
      "嘿，别被力量冲昏了头脑。",
      "虽然数量不少，但我相信你能应付得来。",
      "如果你的符文哪天出问题了，嗯，你知道该找谁。",
      "回头见。"
    ]
  },
  glyphLevel1: {
    id: 10,
    requirement: () => player.records.bestEndgame.glyphLevel.gte(1e5),
    lines: [
      "六位数的符文等级，哼哼？",
      "你跨越的高墙比我设立的还多。",
      "我想这应该对你的炼金资源有不错的效果吧。",
      "你知道的，那些可是我帮太阳神制作的。",
      "我最自豪的是现实符文。",
      "我甚至还在上面刻了特蕾莎的符号...",
      "别问，我不会回答的。",
      "总之，好好享受这段变强之旅吧。",
      "还有，自己多加小心。"
    ]
  },
  glyphLevel2: {
    id: 11,
    requirement: () => player.records.bestEndgame.glyphLevel.gte(2e5),
    lines: [
      "哇哦。慢点儿，伙计。",
      "再推一把，你的符文等级就要达到数百万了。",
      "源初之神和我都没意料到...",
      "祂刚让我在这里再设一个符文等级的软上限，所以我只能这么做了。",
      "嘿，别太难过。",
      "你很快就能拿到那些百万级的符文了。",
      "说实在的，真正关键的其实是炼金资源的加成。",
      "不管怎样，我就不打扰你继续刷级了。",
      "回头见，伙计。"
    ]
  },
  glyphLevel3: {
    id: 12,
    requirement: () => player.records.bestEndgame.glyphLevel.gte(1e6),
    lines: [
      "嘛，你终于还是做到了。",
      "一百万符文等级。",
      "看来你花了不少功夫才走到这一步。",
      "我得开始设计一些更强的软上限了，你突破现有的上限太轻松了。",
      "不能让你的符文等级一直无限制地飙升。",
      "我的意思是，你真的需要等级超过一百万的符文吗？",
      "好吧，你可以回去继续刷级了。"
    ]
  },
  secondShop: {
    id: 13,
    requirement: () => Achievement(227).isUnlocked,
    lines: [
      "你找到我的另一个商店了。",
      "如你所见，我的许多高级遗物都极为强大。",
      "所以我只好把它锁在一道需要强大力量才能突破的屏障之后。",
      "然而，你还是成功了。",
      "不过我并不惊讶，其实在你突破一百万级符文后，我就预料到你会来了。",
      "那么，欢迎光临。",
      "四处看看吧，如果发现什么感兴趣的东西，请告诉我。"
    ]
  },
  keepRelicShard: {
    id: 14,
    lines: [
      "这次购买对你大有帮助。",
      "你再也不用担心遗迹碎片被重置了。",
      "这将帮助你获得我剩下的库存。"
    ]
  },
  betterGeneration: {
    id: 15,
    lines: [
      "这次购买挺实用的。",
      "它能让你不必通过进行现实来获取更高稀有度的符文。",
      "当然，这纯粹是为了提升游戏体验。不过话说回来，我的商品大部分都是这样。"
    ]
  },
  maxMomentum: {
    id: 16,
    lines: [
      "这次购买真是救命稻草。",
      "每次终局都能省下好多刷符文等级的时间。",
      "说到这个，你见过源初之神了吗？"
    ]
  },
  moreRarityCap: {
    id: 17,
    lines: [
      "这次购买很危险。",
      "这是为数不多并非纯粹提升游戏体验的商品。",
      "请理智使用它。"
    ]
  },
  effEndgame: {
    id: 18,
    lines: [
      "...",
      "你本不该发现那个的。",
      "伙计，悠着点...你要是再毁了我的家，我发誓……"
    ]
  },
  beatEndgame: {
    id: 19,
    lines: [
      "完成了两层现实？",
      "呃，现在我想起来了...",
      "我让佩勒把祂的那层现实给加强了。",
      "可你居然还是获胜了。",
      "至少我家还完好无损...",
      "部分完好无损。",
      "听着，我很喜欢你待在我身边，但你很危险。",
      "所以，拿走我剩下的存货，然后离开吧。",
      "也许有一天我们还会再见。",
      "回头见，%name。"
    ]
  }
};
