export const laitelaQuotes = {
  unlock: {
    id: 0,
    lines: [
      "你终于来了。",
      "我想现在是时候揭开，",
      "隐藏在存在本身之下的秘密。",
      "完美的维度之形，连续统。",
      "以及能结合多元宇宙的，",
      "暗物质和暗能量。",
      "我的知识是无穷无尽的，我的智慧是神圣无垠的。",
      "所以你大可以在周围随心所欲地随便逛逛。",
      "我是维度之神莱特拉，",
      "我将在此，永远地监视着你。",
    ]
  },
  // Note: This can be done immediately after unlocking Lai'tela
  firstDestabilize: {
    id: 1,
    requirement: () => player.celestials.laitela.difficultyTier >= 1,
    lines: [
      "与在我之下的其他存在不同，我不需要现实。",
      "因为我能轻易创造它们，即使现实崩塌我也将长存于此。",
      "我拥有一种相对于建造现实而言，比其他力量更加难以置信的能力。",
      "比如创造甚至可以限制天神的，一个牢狱。",
      "这就是你做什么都不会改变其分毫的原因。",
      "在你疲于挣扎之时，你也会受到束缚，会被遗忘。",
      "你永远都找不到超越我的方法。",
    ]
  },
  // Note: This happens about an hour or two before singularities
  secondDestabilize: {
    id: 2,
    requirement: () => player.celestials.laitela.difficultyTier >= 2,
    lines: [
      "你…看起来有点太欢乐了。",
      "正如祂们在见到祂们的命运之前所做的那样。",
      "也许我的裁决是严厉的，或是毫无道理的。",
      "但也许这并不重要。",
      "它让我没有闲暇的宽慰去思考或回顾。",
      "我能做的就是回忆我能采取的每一项行动。",
      "呵，我跑题了。我们只需要收紧这些链条。",
    ]
  },
  firstSingularity: {
    id: 3,
    requirement: () => Currency.singularities.gte(1),
    lines: [
      "据我所知，我永远无需提出质疑的必要。",
      "一切都按设计正常运转。",
      "然而，你的到来令我感到困惑。",
      "你是否总在视线之外？",
      "增长、控制、理解、飞升？",
      "你很快控制了黑暗，太快了。",
      "将它们融入你自己的设计之中，并凝聚成奇点…",
      "那…那不会改变什么。最终都是同样的结局。",
    ]
  },
  // Note: Shown when unlocking DMD3; requirement is auto-condensing 20 singularities and it happens around ~200 total
  thirdDMD: {
    id: 5,
    lines: [
      "你对反物质的绝对掌控…",
      "你将它研究通透，将它变为你自己的力量…",
      "这绝对不是一场意外。",
      "你是怎么做到的？",
      "有意思…我从来都没有意识到这一点",
      "——吗？",
    ]
  },
  // Note: This happens around e10-e11 singularities
  annihilation: {
    id: 4,
    lines: [
      "再一次回到了原点。",
      "随着你的末日逐渐来临，你的枷锁将越加紧束。",
      "而我们超越了时间，超越了存在本身。",
      "即使我们终将消亡，我们将以前所未见的姿态回归。",
      "就这样…循环往复。",
      "至于你？",
      "…",
      "我…不知道…",
    ]
  },
  // Note: This happens near e18 singularities
  halfDimensions: {
    id: 6,
    requirement: () => player.celestials.laitela.difficultyTier >= 4,
    lines: [
      "我不理解…",
      "其祂的天神…也是这样操纵维度的吗？",
      "祂们…消失了吗？我们怎么会找不到祂们？",
      "祂们…就是我们？我们就是终焉吗？",
      "或者我们无法理解…祂们的命运？",
      "不，我一定是忽略了什么…",
      "是你让我的记忆出现间隙的吗？",
      "你…究竟是谁？",
    ]
  },
  // Note: Shown when the first row 5 iM upgrade is purchased (~e26 singularities)
  finalRowIM: {
    id: 7,
    lines: [
      "这不可能，这超出了我的理解范围…",
      "除非…这所有的一切都只是轮回的一部分？",
      "你能…看透这一切？这就是…为什么吗…",
      "我…害怕了？",
      "我…我的力量，我的记忆，正在消失…",
      "就像…我几乎失去了我的角色…",
      "然而…我无能为力。",
      "因为这是…我的…错…",
    ]
  },
  // Note: This is around when all infinite milestones hit increased scaling
  increasedMilestoneScaling: {
    id: 8,
    requirement: () => Currency.singularities.gte(1e40),
    lines: [
      "我不知道…我还能坚持多久…",
      "你正在…完全掌控…黑暗…",
      "而我无法…留名青史…",
      "我…还能…做什么？",
    ]
  },
  fullDestabilize: {
    id: 9,
    requirement: () => player.celestials.laitela.difficultyTier >= 8,
    lines: [
      "我感到…我有什么话想说…",
      "我不确定…",
      "我再也不能…维持黑暗了…",
      "我甚至…什么都没有了…",
      "关于…摧毁…",
      "终焉…",
    ]
  },
  expansionPacks: {
    id: 10,
    lines: [
      "看吧，佩勒？",
      "我早跟你说过，是太阳神试图篡夺我的地位。",
      "我现在可以制裁祂了吗？",
      "求求你啦？？？",
      "等等，毁灭者怎么会在这里？",
      "我以为你已经打败他了，佩勒。",
      "你之前只是拖慢了他的进度吗？",
      "你这么做很善良，但像他这样的人其实不配得到这种宽恕。",
      "好吧，我先制裁太阳神，然后再制裁毁灭者。",
      "听起来不错吧？佩勒？"
    ]
  },
  dmd5: {
    id: 11,
    requirement: () => ImaginaryUpgrade(26).isBought,
    lines: [
      "啊，看来你找到了我的秘密维度……",
      "你是怎么凑齐所需的奇点的？",
      "我不明白……",
      "你到底拥有何种力量？",
      "这一定比我想象的还要强大。",
      "你见过一位名叫源初之神的神明吗？",
      "记不起来了，是吗？",
      "祂跟我提过这种隐秘之力...",
      "那叫...",
      "星系？",
      "虽然我觉得祂当时像喝多了，但我认识的存在里没人能创造星系。",
      "也许除了源初之神自己之外。",
      "但肯定有什么..."
    ]
  },
  dmd6: {
    id: 12,
    requirement: () => ImaginaryUpgrade(27).isBought,
    lines: [
      "可真够慢的。",
      "我本以为你永远都只能找到第五维度呢。",
      "看来是我错了...",
      "让我看看你还能走多远..."
    ]
  },
  dmd7: {
    id: 13,
    requirement: () => ImaginaryUpgrade(28).isBought,
    lines: [
      "真快..",
      "你肯定发现了什么漏洞。",
      "或者说我的奇点本就如此强大。",
      "我应该更多地使用它们。"
    ]
  },
  dmd8: {
    id: 14,
    requirement: () => ImaginaryUpgrade(29).isBought,
    lines: [
      "这是第八维度了。",
      "你把所有维度都找到了...",
      "这仅意味着...",
      "你毁了佩勒？？？",
      "怎么办到的？",
      "除了祂自己没有任何存在能摧毁祂...",
      "源初之神一定是以某种方式在帮你。",
      "祂在哪里？",
      "你怎会不知道？",
      "你到底拥有了何种我等都没有的力量？",
      "我不明白。",
      "你没有杀了佩勒...对吧？",
      "我真希望没有...",
      "你最好没这么做，行吗？",
      "如果祂不在了我真不知道该怎么办..."
    ]
  },
  laitelaPack: {
    id: 15,
    requirement: () => ExpansionPack.laitelaPack.isBought,
    lines: [
      "我原以为你已经无法变得更强大了...",
      "你不仅找到并掌控了我隐藏起来的黑暗...",
      "你还找到了恢复我的现实的方法...",
      "这仅仅是为了再次摧毁它？",
      "你到底是什么样的变态怪物？！？！",
      "...",
      "抱歉，我不该吼的。",
      "但为什么？",
      "你只是想把它当作暗物质来采集吗？",
      "我想这应该会有帮助……",
      "最坏的情况，我也可以再创造一个新的现实。",
      "别把它也毁了，好吗？",
      "谢谢。"
    ]
  },
  hadrons: {
    id: 16,
    requirement: () => DualityUpgrade(15).isBought,
    lines: [
      "所以...",
      "你竟成功将我现实中的熵夸克凝聚起来，",
      "并创造了一个强子...",
      "真令人着迷。",
      "我从未想过任何存在能获得这种力量，更别说像你这样的凡人了。",
      "不过我想，你已经不再只是个凡人了。",
      "你已经变成了某种...更强的存在。",
      "真想知道你还能做出什么。"
    ]
  },
  darkHadrons: {
    id: 17,
    requirement: () => DualityUpgrade(19).isBought,
    lines: [
      "那是什么？",
      "你不仅拥有这些...强子...",
      "而且竟还能用暗物质创造出一个！",
      "我从未想过我的完美粒子竟有如此大的能力。",
      "你让我很感兴趣，%name。",
      "也许有一天你能够当我的老师。",
      "我想更深入地了解自己能力的极限。",
      "我想总有一天我会达到那个境界的，对吧？"
    ]
  },
  massHadron: {
    id: 18,
    requirement: () => Laitela.hadronizes >= 25,
    lines: [
      "二十五次...",
      "显然你不会轻言放弃，对吧？",
      "你还打算在这里待多久？",
      "我想只要有必要，就会一直待下去吧？",
      "嗯，至少我很高兴你觉得我的能力有意思。",
      "看来这说明我在宇宙层面上还有些价值...",
      "佩勒会为我感到骄傲的..."
    ]
  },
  autoHadron: {
    id: 19,
    requirement: () => DivinityMilestone.hadronEmpowerment.isReached,
    lines: [
      "嗨，%name。",
      "我想你没料到我们会在此地见面吧？",
      "我看到你对佩勒的旧现实所做的事，和对我自己的现实所做的一模一样。",
      "压缩其至榨干最后一丝力量，却又不知为何使其完好无损。",
      "我甚至不知道你该从哪里着手做这种事...",
      "你问我为什么在这里？",
      "哦，很简单。",
      "我看到你成功创造了一种新型强子。",
      "这个是用奇迹物质合成的，对吧？",
      "或者至少是用奇迹物质的构造单元合成的。",
      "曾经有一个专门研究奇迹物质的存在...",
      "这选择挺奇怪的，毕竟反物质潜力那么大...",
      "但祂找到了类似于反物质的增量方法。",
      "祂现在身处另一个现实中，大概还在研究如何利用祂的奇迹物质。",
      "也许你知道祂的名字。",
      "不过现在先别管这个了，我看到你也解锁了强子的连续统。",
      "看来你已经...成功编程了——如果这个词用得恰当的话...让我的现实尽可能自动失稳。",
      "这确实是一种迷人的力量。",
      "能如此完全地掌控黑暗...",
      "或许有朝一日我也能达到那种境界。",
      "哦，谢谢你没有让它坍缩。",
      "你知道吗，经历这一切后还能有个居所，这真的意义重大。",
      "很高兴你能像掌控其它能力那样，控制住自己的毁灭能力。"
    ]
  },
  gigaHadron: {
    id: 18,
    requirement: () => Laitela.hadronizes >= 100,
    lines: [
      "这...你的强子数量可真不少啊。",
      "哦，又见到你了，%name。",
      "我刚才还在感叹，你竟然能从奇点中创造出如此多的物质。",
      "也许你不仅擅长毁灭...还擅长创造。",
      "这是很好的平衡。",
      "当然，我还可以滔滔不绝地谈论湮灭、衰变之类的话题...",
      "但你并不想听我讲这些，对吧？",
      "这些话我留到你见到‘祂’的时候再说吧。",
      "祂知道的比你多得多，能告诉你整个多元宇宙是如何运转的。",
      "我相信你会很享受与祂相处的时光。",
      "希望我们能很快再见。"
    ]
  }
};
