export const teresaQuotes = {
  initial: {
    id: 0,
    lines: [
      "我们一直在观察你。",
      "你已经展示了你扭曲现实的能力。",
      "我们是被称为天神的存在，我们希望你能加入我们的行列。",
      "我是现实之神特蕾莎。",
      "证明你的价值。",
    ]
  },
  unlockReality: {
    id: 1,
    lines: [
      "我会让你进入我的现实，不要被它击垮。"
    ]
  },
  completeReality: {
    id: 2,
    lines: [
      "为什么你还在这里…你应该失败才是。"
    ]
  },
  effarig: {
    id: 3,
    lines: [
      "你仍然远不及我们。",
      "我希望祂者会在我失败的地方取得成功。"
    ]
  },
  expansionPacks: {
    id: 4,
    lines: [
      "什么——",
      "我身处何地？",
      "等等——",
      "是你？！？！",
      "是你打败了我……",
      "多少次了？",
      "我记不清了……",
      "你们也在这里吗？"
    ]
  },
  teresaPack: {
    id: 5,
    requirement: () => ExpansionPack.teresaPack.isBought,
    lines: [
      "哦，嗨，毁灭之源。",
      "看来你找到我的秘密商店了。",
      "听着，我有件事想问。",
      "你为什么执着于打败我们？",
      "我们对你来说……只是阻碍吗？",
      "还是另有原因……",
      "其实不必这样，你知道的。",
      "当然，我大概也改变不了你的想法。",
      "只是别伤害其他人。",
      "祂们是我的朋友，你知道的？",
      "我想我还是该让你回去……做你现在正在做的事吧。",
      "那，回头见吧。"
    ]
  },
  fullCharge: {
    id: 6,
    requirement: () => Teresa.totalCharges >= 5,
    lines: [
      "嗯，这最后一批升级也充能了。",
      "既然不用再纠结该给哪些升级充能了，接下来的推进应该会更轻松吧。",
      "嗯，这大概是我最后一次光顾我的店了吧。",
      "你现在在我身边真好，而且没有那些...你知道的...",
      "破坏。",
      "不过，这大概就是你的风格吧？",
      "积聚力量，超越我们所有人...",
      "佩勒不会跟你明说，但其实祂已经开始担心了。",
      "担心你会打败祂。",
      "当然，祂确实是我们当中最强的...但即便是祂也有极限。",
      "我想我可能无意中助了你一臂之力，促成了祂的失败...",
      "但别杀了他，好吗？",
      "小心点。"
    ]
  }
};
